In [43]:
import numpy as np
import pandas as pd

In [44]:
df = pd.DataFrame(
    {'nombres':['Juan', 'Ronald', 'Carla','Nuria','Jose','Deni',None],
     'edades':[35,36,28,19,25,'No te lo digo',None],
     'dinero':[1_000,5_000,500,1_000_000,'anda a lavarte','casi un millon',None],
     'soy Nuria':[False,False,False,True,False,False,None],
     'id':[1,2,3,4,5,6,7]}
    )
df

  nombres         edades          dinero soy Nuria  id
0    Juan             35            1000     False   1
1  Ronald             36            5000     False   2
2   Carla             28             500     False   3
3   Nuria             19         1000000      True   4
4    Jose             25  anda a lavarte     False   5
5    Deni  No te lo digo  casi un millon     False   6
6    None           None            None      None   7

# Analizar los datos

In [45]:
df.size

35

In [46]:
df.shape

(7, 5)

In [47]:
df.columns

Index(['nombres', 'edades', 'dinero', 'soy Nuria', 'id'], dtype='object')

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     6 non-null      object
 3   soy Nuria  6 non-null      object
 4   id         7 non-null      int64
dtypes: int64(1), object(4)
memory usage: 412.0+ bytes

In [49]:
df.describe()

             id
count  7.000000
mean   4.000000
std    2.160247
min    1.000000
25%    2.500000
50%    4.000000
75%    5.500000
max    7.000000

In [50]:
df.describe(include='object')

       nombres  edades  dinero soy Nuria
count        6       6       6         6
unique       6       6       6         2
top       Juan      35    1000     False
freq         1       1       1         5

In [51]:
df['id'] = df['id'].astype('int8')

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     6 non-null      object
 2   dinero     6 non-null      object
 3   soy Nuria  6 non-null      object
 4   id         7 non-null      int8
dtypes: int8(1), object(4)
memory usage: 363.0+ bytes

In [53]:
df

  nombres         edades          dinero soy Nuria  id
0    Juan             35            1000     False   1
1  Ronald             36            5000     False   2
2   Carla             28             500     False   3
3   Nuria             19         1000000      True   4
4    Jose             25  anda a lavarte     False   5
5    Deni  No te lo digo  casi un millon     False   6
6    None           None            None      None   7

In [54]:
df.loc[4, "dinero"] = np.nan

In [55]:
df.loc[5, "dinero"] = 999_999

In [56]:
df['edades'] = df['edades'].apply(lambda x: np.nan if x == 'No te lo digo' else x)

In [57]:
df

  nombres  edades   dinero soy Nuria  id
0    Juan    35.0     1000     False   1
1  Ronald    36.0     5000     False   2
2   Carla    28.0      500     False   3
3   Nuria    19.0  1000000      True   4
4    Jose    25.0      NaN     False   5
5    Deni     NaN   999999     False   6
6    None     NaN     None      None   7

In [218]:
df['dinero'] = df['dinero'].astype('Int32')

In [219]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    6 non-null      object
 1   edades     5 non-null      float64
 2   dinero     5 non-null      Int32
 3   soy Nuria  6 non-null      object
 4   id         7 non-null      int8
dtypes: Int32(1), float64(1), int8(1), object(2)
memory usage: 342.0+ bytes

In [225]:
(df.isnull().sum()/len(df))*100

nombres      14.285714
edades       28.571429
dinero       28.571429
soy Nuria    14.285714
id            0.000000
dtype: float64

In [238]:
for i in df:
    print(i)
    print((len(df[i].unique())/len(df)) *100)

nombres
100.0
edades
85.71428571428571
dinero
85.71428571428571
soy Nuria
42.857142857142854
id
100.0